macwed/rfmesh-workspace/firmware/sdkconfig.defaults
# --- IDF target -----------------------------------------------------------
# ESP32-C6 has the same USB-Serial-JTAG peripheral as the C3 (D+/D- on
# GPIO12/GPIO13). No TinyUSB stack needed — the JTAG peripheral exposes a
# CDC-ACM endpoint to the host directly. Console + protocol RX/TX both ride
# the usb_serial_jtag driver in main.c.
CONFIG_IDF_TARGET="esp32c6"

# --- Console / USB-Serial-JTAG --------------------------------------------
# Route stdio (printf, ESP_LOG) through the USB-Serial-JTAG peripheral.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# RX/TX ringbuf sizes are set at runtime via usb_serial_jtag_driver_config_t
# in firmware/main/main.c (USB_RX_BUF_BYTES / USB_TX_BUF_BYTES). No Kconfig
# knob exists for the driver-installed buffers in IDF v5.4.

# --- Radios off (saves flash, removes coexistence headaches) --------------
# The C6 has Wi-Fi 6 / BLE 5 / 802.15.4 (Thread/Zigbee). For the servo node
# we use none of them — disable everything to keep the binary small and
# remove the coexistence layer entirely.
CONFIG_BT_ENABLED=n
CONFIG_ESP_WIFI_ENABLED=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n
CONFIG_OPENTHREAD_ENABLED=n
CONFIG_IEEE802154_ENABLED=n

# --- Scheduler / NVS ------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_NVS_ENCRYPTION=n

# --- Compiler -------------------------------------------------------------
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_WARN_WRITE_STRINGS=y
